socialNetwork/wrk2/user-timeline-without-istio/COMMAND_11/32
Running 1m test @ http://localhost:31111/wrk2-api/post/compose
  8 threads and 16 connections
  Thread calibration: mean lat.: 2551.568ms, rate sampling interval: 9453ms
  Thread calibration: mean lat.: 2518.741ms, rate sampling interval: 9306ms
  Thread calibration: mean lat.: 2487.909ms, rate sampling interval: 9281ms
  Thread calibration: mean lat.: 2482.103ms, rate sampling interval: 9248ms
  Thread calibration: mean lat.: 2600.268ms, rate sampling interval: 9584ms
  Thread calibration: mean lat.: 2525.677ms, rate sampling interval: 9379ms
  Thread calibration: mean lat.: 2521.903ms, rate sampling interval: 9396ms
  Thread calibration: mean lat.: 2492.127ms, rate sampling interval: 9281ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     9.54s     4.82s   21.94s    83.94%
    Req/Sec    37.85     16.40    62.00     60.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    7.97s 
 75.000%   10.30s 
 90.000%   18.46s 
 99.000%   21.94s 
 99.900%   24.79s 
 99.990%   24.92s 
 99.999%   24.94s 
100.000%   24.94s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4583.423     0.000000            1         1.00
    5206.015     0.100000         1475         1.11
    5586.943     0.200000         2936         1.25
    6553.599     0.300000         4404         1.43
    7434.239     0.400000         5867         1.67
    7970.815     0.500000         7338         2.00
    8261.631     0.550000         8066         2.22
    8585.215     0.600000         8808         2.50
    8896.511     0.650000         9530         2.86
    9347.071     0.700000        10270         3.33
   10305.535     0.750000        10998         4.00
   11657.215     0.775000        11361         4.44
   12574.719     0.800000        11728         5.00
   13828.095     0.825000        12096         5.71
   14770.175     0.850000        12461         6.67
   17645.567     0.875000        12830         8.00
   18087.935     0.887500        13017         8.89
   18464.767     0.900000        13197        10.00
   18907.135     0.912500        13385        11.43
   19972.095     0.925000        13563        13.33
   20414.463     0.937500        13752        16.00
   20594.687     0.943750        13838        17.78
   20791.295     0.950000        13928        20.00
   20905.983     0.956250        14019        22.86
   21037.055     0.962500        14114        26.67
   21217.279     0.968750        14207        32.00
   21266.431     0.971875        14250        35.56
   21315.583     0.975000        14294        40.00
   21381.119     0.978125        14340        45.71
   21479.423     0.981250        14389        53.33
   21594.111     0.984375        14433        64.00
   21692.415     0.985938        14455        71.11
   21790.719     0.987500        14477        80.00
   21889.023     0.989062        14503        91.43
   22036.479     0.990625        14522       106.67
   23986.175     0.992188        14546       128.00
   24068.095     0.992969        14557       142.22
   24133.631     0.993750        14568       160.00
   24199.167     0.994531        14583       182.86
   24248.319     0.995313        14591       213.33
   24313.855     0.996094        14603       256.00
   24346.623     0.996484        14609       284.44
   24395.775     0.996875        14615       320.00
   24444.927     0.997266        14621       365.71
   24477.695     0.997656        14625       426.67
   24543.231     0.998047        14631       512.00
   24592.383     0.998242        14634       568.89
   24608.767     0.998437        14637       640.00
   24625.151     0.998633        14639       731.43
   24772.607     0.998828        14643       853.33
   24805.375     0.999023        14645      1024.00
   24821.759     0.999121        14647      1137.78
   24838.143     0.999219        14650      1280.00
   24838.143     0.999316        14650      1462.86
   24854.527     0.999414        14652      1706.67
   24854.527     0.999512        14652      2048.00
   24870.911     0.999561        14654      2275.56
   24870.911     0.999609        14654      2560.00
   24870.911     0.999658        14654      2925.71
   24887.295     0.999707        14656      3413.33
   24887.295     0.999756        14656      4096.00
   24887.295     0.999780        14656      4551.11
   24903.679     0.999805        14657      5120.00
   24903.679     0.999829        14657      5851.43
   24903.679     0.999854        14657      6826.67
   24920.063     0.999878        14658      8192.00
   24920.063     0.999890        14658      9102.22
   24920.063     0.999902        14658     10240.00
   24920.063     0.999915        14658     11702.86
   24920.063     0.999927        14658     13653.33
   24936.447     0.999939        14659     16384.00
   24936.447     1.000000        14659          inf
#[Mean    =     9538.898, StdDeviation   =     4820.139]
#[Max     =    24920.064, Total count    =        14659]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  19706 requests in 1.00m, 4.04MB read
  Socket errors: connect 0, read 0, write 0, timeout 110
Requests/sec:    328.38
Transfer/sec:     68.95KB